{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"input_layers": [["input_3", 0, 0]], "name": "model_3", "layers": [{"class_name": "InputLayer", "name": "input_3", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 1], "name": "input_3", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_11", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_9", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "leaky_re_lu_9", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_7", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_7", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_12", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_10", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"name": "leaky_re_lu_10", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_8", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_8", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_13", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_11", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"name": "leaky_re_lu_11", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_9", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_9", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_14", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 256, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_12", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"name": "leaky_re_lu_12", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_10", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_10", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_15", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_11", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_11", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]], "config": {"name": "concatenate_1", "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_2", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_16", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_12", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_12", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_2", "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]], "config": {"name": "concatenate_2", "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_3", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_3", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_17", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_13", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_13", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_3", "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]], "config": {"name": "concatenate_3", "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_4", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_4", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_18", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 1, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "output_layers": [["conv2d_18", 0, 0]]}}