{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "name": "input_6", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "name": "input_6"}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "input_5", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "name": "input_5"}, "inbound_nodes": []}, {"class_name": "Model", "name": "model_4", "config": {"layers": [{"class_name": "InputLayer", "name": "input_4", "config": {"sparse": false, "dtype": "float32", "name": "input_4", "batch_input_shape": [null, 128, 128, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_19", "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_13", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_13", "trainable": true}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_14", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_14"}, "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_20", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_14", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_14", "trainable": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_15", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_15"}, "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_21", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_15", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_15", "trainable": true}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_16", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_16"}, "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_22", "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_16", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_16", "trainable": true}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_17", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_17"}, "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_5", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_5", "trainable": true}, "inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_23", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_23", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_18", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_18"}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_4", "config": {"axis": -1, "name": "concatenate_4", "trainable": true}, "inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_6", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_6", "trainable": true}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_24", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_24", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_19", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_19"}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_5", "config": {"axis": -1, "name": "concatenate_5", "trainable": true}, "inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_7", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_7", "trainable": true}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_25", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_25", "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_20", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_20"}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_6", "config": {"axis": -1, "name": "concatenate_6", "trainable": true}, "inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_8", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_8", "trainable": true}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_26", "config": {"activation": "tanh", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_26", "kernel_constraint": null, "filters": 1, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]]}], "output_layers": [["conv2d_26", 0, 0]], "name": "model_4", "input_layers": [["input_4", 0, 0]]}, "inbound_nodes": [[["input_6", 0, 0, {}]], [["model_3", 1, 0, {}]]]}, {"class_name": "Model", "name": "model_3", "config": {"layers": [{"class_name": "InputLayer", "name": "input_3", "config": {"sparse": false, "dtype": "float32", "name": "input_3", "batch_input_shape": [null, 128, 128, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_11", "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_9", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_9", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_7", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_7"}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_12", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_10", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_10", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_8", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_8"}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_13", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_11", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_11", "trainable": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_9", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_9"}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_14", "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_12", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_12", "trainable": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_10", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_10"}, "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1", "trainable": true}, "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_15", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_11", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_11"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2", "trainable": true}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_16", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_12", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_12"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_2", "config": {"axis": -1, "name": "concatenate_2", "trainable": true}, "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_3", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3", "trainable": true}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_17", "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_13", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_13"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_3", "config": {"axis": -1, "name": "concatenate_3", "trainable": true}, "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_4", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_4", "trainable": true}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"activation": "tanh", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_18", "kernel_constraint": null, "filters": 1, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]]}], "output_layers": [["conv2d_18", 0, 0]], "name": "model_3", "input_layers": [["input_3", 0, 0]]}, "inbound_nodes": [[["input_5", 0, 0, {}]], [["model_4", 1, 0, {}]]]}, {"class_name": "Model", "name": "model_1", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 128, 128, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_1", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_1", "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_2", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_2", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_1", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_1"}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_3", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_3", "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_2", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_2"}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_4", "kernel_constraint": null, "filters": 512, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_4", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_4", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_3", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_3"}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_5", "kernel_constraint": null, "filters": 1, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_3", 0, 0, {}]]]}], "output_layers": [["conv2d_5", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "inbound_nodes": [[["model_4", 1, 0, {}]]]}, {"class_name": "Model", "name": "model_2", "config": {"layers": [{"class_name": "InputLayer", "name": "input_2", "config": {"sparse": false, "dtype": "float32", "name": "input_2", "batch_input_shape": [null, 128, 128, 1]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_6", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_5", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_5", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_7", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_6", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_6", "trainable": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_4", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_4"}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_8", "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_7", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_7", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_5", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_5"}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_9", "kernel_constraint": null, "filters": 512, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_5", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_8", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_8", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_6", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_6"}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_10", "kernel_constraint": null, "filters": 1, "data_format": "channels_last", "padding": "same", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_6", 0, 0, {}]]]}], "output_layers": [["conv2d_10", 0, 0]], "name": "model_2", "input_layers": [["input_2", 0, 0]]}, "inbound_nodes": [[["model_3", 1, 0, {}]]]}], "output_layers": [["model_1", 1, 0], ["model_2", 1, 0], ["model_3", 1, 0], ["model_4", 1, 0], ["model_4", 2, 0], ["model_3", 2, 0]], "name": "model_5", "input_layers": [["input_5", 0, 0], ["input_6", 0, 0]]}}