{"keras_version": "2.1.5", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_1", "trainable": true, "data_format": "channels_last", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_2", "trainable": true, "data_format": "channels_last", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "instance_normalization_1", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_1", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_1", 0, 0, {}]]], "name": "conv2d_3", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_3", "trainable": true, "data_format": "channels_last", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "leaky_re_lu_3", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "instance_normalization_2", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_2", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_2", 0, 0, {}]]], "name": "conv2d_4", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_4", "trainable": true, "data_format": "channels_last", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "leaky_re_lu_4", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "instance_normalization_3", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_3", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_3", 0, 0, {}]]], "name": "conv2d_5", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_5", "trainable": true, "data_format": "channels_last", "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}], "output_layers": [["conv2d_5", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}