{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_1", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_1", "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_2", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_2", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_1", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_1"}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_3", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_3", "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_2", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_2"}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_4", "kernel_constraint": null, "filters": 512, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_4", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_4", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_3", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_3"}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_5", "kernel_constraint": null, "filters": 1, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_3", 0, 0, {}]]]}], "output_layers": [["conv2d_5", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}