{"keras_version": "2.1.5", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_4", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_19", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_19", "trainable": true, "data_format": "channels_last", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "leaky_re_lu_13", "config": {"name": "leaky_re_lu_13", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "name": "instance_normalization_14", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_14", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]], "name": "conv2d_20", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_20", "trainable": true, "data_format": "channels_last", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "leaky_re_lu_14", "config": {"name": "leaky_re_lu_14", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "name": "instance_normalization_15", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_15", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]], "name": "conv2d_21", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_21", "trainable": true, "data_format": "channels_last", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "leaky_re_lu_15", "config": {"name": "leaky_re_lu_15", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "name": "instance_normalization_16", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_16", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]], "name": "conv2d_22", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_22", "trainable": true, "data_format": "channels_last", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "leaky_re_lu_16", "config": {"name": "leaky_re_lu_16", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "name": "instance_normalization_17", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_17", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]], "name": "up_sampling2d_5", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_5", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "name": "conv2d_23", "config": {"activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_23", "trainable": true, "data_format": "channels_last", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "instance_normalization_18", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_18", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]], "name": "concatenate_4", "config": {"trainable": true, "name": "concatenate_4", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "up_sampling2d_6", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_6", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "name": "conv2d_24", "config": {"activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_24", "trainable": true, "data_format": "channels_last", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "instance_normalization_19", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_19", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]], "name": "concatenate_5", "config": {"trainable": true, "name": "concatenate_5", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "name": "up_sampling2d_7", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_7", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]], "name": "conv2d_25", "config": {"activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_25", "trainable": true, "data_format": "channels_last", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "instance_normalization_20", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_20", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]], "name": "concatenate_6", "config": {"trainable": true, "name": "concatenate_6", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "name": "up_sampling2d_8", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_8", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "name": "conv2d_26", "config": {"activation": "tanh", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_26", "trainable": true, "data_format": "channels_last", "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}], "output_layers": [["conv2d_26", 0, 0]], "name": "model_4", "input_layers": [["input_4", 0, 0]]}, "backend": "tensorflow"}