{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"input_layers": [["input_4", 0, 0]], "name": "model_4", "layers": [{"class_name": "InputLayer", "name": "input_4", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 1], "name": "input_4", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_19", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_13", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"name": "leaky_re_lu_13", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_14", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_14", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_20", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_14", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"name": "leaky_re_lu_14", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_15", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_15", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_21", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_15", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"name": "leaky_re_lu_15", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_16", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_16", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_22", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 256, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_16", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"name": "leaky_re_lu_16", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_17", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_17", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_5", "inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_5", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_23", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_18", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_18", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_4", "inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]], "config": {"name": "concatenate_4", "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_6", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_6", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_24", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_19", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_19", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_5", "inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]], "config": {"name": "concatenate_5", "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_7", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_7", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_25", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_20", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_20", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_6", "inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]], "config": {"name": "concatenate_6", "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_8", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_8", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_26", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 1, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "output_layers": [["conv2d_26", 0, 0]]}}