{"keras_version": "2.1.5", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_6", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_6"}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "input_5", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_5"}}, {"class_name": "Model", "inbound_nodes": [[["input_6", 0, 0, {}]], [["model_3", 1, 0, {}]]], "name": "model_4", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_4", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_4"}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_19", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_13", "config": {"name": "leaky_re_lu_13", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_14", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_14", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_20", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_14", "config": {"name": "leaky_re_lu_14", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_15", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_15", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_21", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_21", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_15", "config": {"name": "leaky_re_lu_15", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_16", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_16", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_22", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_22", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_16", "config": {"name": "leaky_re_lu_16", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_17", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_17", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_5", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_5", "trainable": true}}, {"inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_23", "config": {"activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_23", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_18", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_18", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_4", "config": {"axis": -1, "name": "concatenate_4", "trainable": true}}, {"inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_6", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_6", "trainable": true}}, {"inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_24", "config": {"activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_24", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_19", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_19", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_5", "config": {"axis": -1, "name": "concatenate_5", "trainable": true}}, {"inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_7", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_7", "trainable": true}}, {"inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_25", "config": {"activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_25", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_20", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_20", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_6", "config": {"axis": -1, "name": "concatenate_6", "trainable": true}}, {"inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_8", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_8", "trainable": true}}, {"inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_26", "config": {"activation": "tanh", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_26", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}], "output_layers": [["conv2d_26", 0, 0]], "name": "model_4", "input_layers": [["input_4", 0, 0]]}}, {"class_name": "Model", "inbound_nodes": [[["input_5", 0, 0, {}]], [["model_4", 1, 0, {}]]], "name": "model_3", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_3", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_3"}}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_11", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_9", "config": {"name": "leaky_re_lu_9", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_7", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_7", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_12", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_10", "config": {"name": "leaky_re_lu_10", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_8", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_8", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_13", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_11", "config": {"name": "leaky_re_lu_11", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_9", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_9", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_14", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_12", "config": {"name": "leaky_re_lu_12", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_10", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_10", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1", "trainable": true}}, {"inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_15", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_11", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_11", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2", "trainable": true}}, {"inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_16", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_12", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_12", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2", "config": {"axis": -1, "name": "concatenate_2", "trainable": true}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_3", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3", "trainable": true}}, {"inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_17", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_13", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_13", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_3", "config": {"axis": -1, "name": "concatenate_3", "trainable": true}}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_4", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_4", "trainable": true}}, {"inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18", "config": {"activation": "tanh", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_18", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}], "output_layers": [["conv2d_18", 0, 0]], "name": "model_3", "input_layers": [["input_3", 0, 0]]}}, {"class_name": "Model", "inbound_nodes": [[["model_4", 1, 0, {}]]], "name": "model_1", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_1", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_1", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_2", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_2", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_1", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_1", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_3", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_3", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_2", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_2", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_4", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_4", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_3", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_3", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_5", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}], "output_layers": [["conv2d_5", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}, {"class_name": "Model", "inbound_nodes": [[["model_3", 1, 0, {}]]], "name": "model_2", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_2"}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_6", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_5", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_7", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_6", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_4", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_4", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_8", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_7", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_5", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_5", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_9", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_8", "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.20000000298023224}}, {"inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "class_name": "InstanceNormalization", "name": "instance_normalization_6", "config": {"epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": null, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_6", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"inbound_nodes": [[["instance_normalization_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_10", "trainable": true, "dilation_rate": [1, 1], "padding": "same", "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [4, 4]}}], "output_layers": [["conv2d_10", 0, 0]], "name": "model_2", "input_layers": [["input_2", 0, 0]]}}], "output_layers": [["model_1", 1, 0], ["model_2", 1, 0], ["model_3", 1, 0], ["model_4", 1, 0], ["model_4", 2, 0], ["model_3", 2, 0]], "name": "model_5", "input_layers": [["input_5", 0, 0], ["input_6", 0, 0]]}, "backend": "tensorflow"}