{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "name": "input_3", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "name": "input_3"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_11", "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_9", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_9", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_7", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_7"}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_12", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_10", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_10", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_8", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_8"}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_13", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_11", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_11", "trainable": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_9", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_9"}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_14", "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_12", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_12", "trainable": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_10", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_10"}, "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1", "trainable": true}, "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_15", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_11", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_11"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2", "trainable": true}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_16", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_12", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_12"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_2", "config": {"axis": -1, "name": "concatenate_2", "trainable": true}, "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_3", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3", "trainable": true}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_17", "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_13", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_13"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_3", "config": {"axis": -1, "name": "concatenate_3", "trainable": true}, "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_4", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_4", "trainable": true}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"activation": "tanh", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_18", "kernel_constraint": null, "filters": 1, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]]}], "output_layers": [["conv2d_18", 0, 0]], "name": "model_3", "input_layers": [["input_3", 0, 0]]}}