{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "name": "input_4", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "name": "input_4"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_19", "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_13", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_13", "trainable": true}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_14", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_14"}, "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_20", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_14", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_14", "trainable": true}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_15", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_15"}, "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_21", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_15", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_15", "trainable": true}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_16", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_16"}, "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"activation": "linear", "dilation_rate": [1, 1], "strides": [2, 2], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_22", "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_16", "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_16", "trainable": true}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_17", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_17"}, "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_5", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_5", "trainable": true}, "inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_23", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_23", "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_18", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_18"}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_4", "config": {"axis": -1, "name": "concatenate_4", "trainable": true}, "inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_6", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_6", "trainable": true}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_24", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_24", "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_19", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_19"}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_5", "config": {"axis": -1, "name": "concatenate_5", "trainable": true}, "inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_7", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_7", "trainable": true}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_25", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_25", "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]]}, {"class_name": "InstanceNormalization", "name": "instance_normalization_20", "config": {"axis": null, "beta_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_20"}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_6", "config": {"axis": -1, "name": "concatenate_6", "trainable": true}, "inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_8", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_8", "trainable": true}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_26", "config": {"activation": "tanh", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "padding": "same", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_26", "kernel_constraint": null, "filters": 1, "data_format": "channels_last", "kernel_size": [4, 4]}, "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]]}], "output_layers": [["conv2d_26", 0, 0]], "name": "model_4", "input_layers": [["input_4", 0, 0]]}}