{"keras_version": "2.1.5", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_3", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv2d_11", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_11", "trainable": true, "data_format": "channels_last", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "leaky_re_lu_9", "config": {"name": "leaky_re_lu_9", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "name": "instance_normalization_7", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_7", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]], "name": "conv2d_12", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_12", "trainable": true, "data_format": "channels_last", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "leaky_re_lu_10", "config": {"name": "leaky_re_lu_10", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "name": "instance_normalization_8", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_8", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]], "name": "conv2d_13", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_13", "trainable": true, "data_format": "channels_last", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "leaky_re_lu_11", "config": {"name": "leaky_re_lu_11", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "instance_normalization_9", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_9", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]], "name": "conv2d_14", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_14", "trainable": true, "data_format": "channels_last", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "leaky_re_lu_12", "config": {"name": "leaky_re_lu_12", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "name": "instance_normalization_10", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_10", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]], "name": "up_sampling2d_1", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "name": "conv2d_15", "config": {"activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_15", "trainable": true, "data_format": "channels_last", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "instance_normalization_11", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_11", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]], "name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "up_sampling2d_2", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "name": "conv2d_16", "config": {"activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_16", "trainable": true, "data_format": "channels_last", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "instance_normalization_12", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_12", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]], "name": "concatenate_2", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "up_sampling2d_3", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "name": "conv2d_17", "config": {"activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_17", "trainable": true, "data_format": "channels_last", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "instance_normalization_13", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_13", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]], "name": "concatenate_3", "config": {"trainable": true, "name": "concatenate_3", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "up_sampling2d_4", "config": {"size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_4", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "name": "conv2d_18", "config": {"activation": "tanh", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_18", "trainable": true, "data_format": "channels_last", "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}], "output_layers": [["conv2d_18", 0, 0]], "name": "model_3", "input_layers": [["input_3", 0, 0]]}, "backend": "tensorflow"}