{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"input_layers": [["input_5", 0, 0], ["input_6", 0, 0]], "name": "model_5", "layers": [{"class_name": "InputLayer", "name": "input_6", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 1], "name": "input_6", "sparse": false, "dtype": "float32"}}, {"class_name": "InputLayer", "name": "input_5", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 1], "name": "input_5", "sparse": false, "dtype": "float32"}}, {"class_name": "Model", "name": "model_4", "inbound_nodes": [[["input_6", 0, 0, {}]], [["model_3", 1, 0, {}]]], "config": {"input_layers": [["input_4", 0, 0]], "name": "model_4", "layers": [{"class_name": "InputLayer", "name": "input_4", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 1], "name": "input_4", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_19", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_13", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"name": "leaky_re_lu_13", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_14", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_14", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_20", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_14", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"name": "leaky_re_lu_14", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_15", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_15", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_21", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_15", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"name": "leaky_re_lu_15", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_16", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_16", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_22", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 256, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_16", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"name": "leaky_re_lu_16", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_17", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_17", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_5", "inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_5", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_23", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_18", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_18", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_4", "inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]], "config": {"name": "concatenate_4", "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_6", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_6", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_24", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_19", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_19", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_5", "inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]], "config": {"name": "concatenate_5", "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_7", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_7", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_25", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_20", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_20", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_6", "inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]], "config": {"name": "concatenate_6", "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_8", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_8", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_26", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 1, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "tanh", "activity_regularizer": null}}], "output_layers": [["conv2d_26", 0, 0]]}}, {"class_name": "Model", "name": "model_3", "inbound_nodes": [[["input_5", 0, 0, {}]], [["model_4", 1, 0, {}]]], "config": {"input_layers": [["input_3", 0, 0]], "name": "model_3", "layers": [{"class_name": "InputLayer", "name": "input_3", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 1], "name": "input_3", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_11", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_9", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "leaky_re_lu_9", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_7", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_7", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_12", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_10", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"name": "leaky_re_lu_10", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_8", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_8", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_13", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_11", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"name": "leaky_re_lu_11", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_9", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_9", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_14", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 256, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_12", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"name": "leaky_re_lu_12", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_10", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_10", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_15", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_11", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_11", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]], "config": {"name": "concatenate_1", "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_2", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_16", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_12", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_12", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_2", "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]], "config": {"name": "concatenate_2", "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_3", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_3", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_17", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_13", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_13", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Concatenate", "name": "concatenate_3", "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]], "config": {"name": "concatenate_3", "axis": -1, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_4", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"size": [2, 2], "name": "up_sampling2d_4", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_18", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 1, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "tanh", "activity_regularizer": null}}], "output_layers": [["conv2d_18", 0, 0]]}}, {"class_name": "Model", "name": "model_1", "inbound_nodes": [[["model_4", 1, 0, {}]]], "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 1], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_1", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "leaky_re_lu_1", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_2", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "leaky_re_lu_2", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_1", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_1", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["instance_normalization_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_3", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 256, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "leaky_re_lu_3", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_2", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_2", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["instance_normalization_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_4", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 512, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "leaky_re_lu_4", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_3", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_3", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["instance_normalization_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_5", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 1, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}], "output_layers": [["conv2d_5", 0, 0]]}}, {"class_name": "Model", "name": "model_2", "inbound_nodes": [[["model_3", 1, 0, {}]]], "config": {"input_layers": [["input_2", 0, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 1], "name": "input_2", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_6", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_5", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "leaky_re_lu_5", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_7", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "leaky_re_lu_6", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_4", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_4", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["instance_normalization_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_8", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 256, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_7", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"name": "leaky_re_lu_7", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_5", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_5", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["instance_normalization_5", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_9", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 512, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_8", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"name": "leaky_re_lu_8", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_6", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_6", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["instance_normalization_6", 0, 0, {}]]], "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_10", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 1, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null}}], "output_layers": [["conv2d_10", 0, 0]]}}], "output_layers": [["model_1", 1, 0], ["model_2", 1, 0], ["model_3", 1, 0], ["model_4", 1, 0], ["model_4", 2, 0], ["model_3", 2, 0]]}}