{"keras_version": "2.1.5", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_6", "trainable": true, "data_format": "channels_last", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "leaky_re_lu_5", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv2d_7", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_7", "trainable": true, "data_format": "channels_last", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "leaky_re_lu_6", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "instance_normalization_4", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_4", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_4", 0, 0, {}]]], "name": "conv2d_8", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_8", "trainable": true, "data_format": "channels_last", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "leaky_re_lu_7", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "instance_normalization_5", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_5", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_5", 0, 0, {}]]], "name": "conv2d_9", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [2, 2], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_9", "trainable": true, "data_format": "channels_last", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "leaky_re_lu_8", "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "instance_normalization_6", "config": {"epsilon": 0.001, "axis": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "instance_normalization_6", "scale": true, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_6", 0, 0, {}]]], "name": "conv2d_10", "config": {"activation": "linear", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_10", "trainable": true, "data_format": "channels_last", "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [4, 4]}}], "output_layers": [["conv2d_10", 0, 0]], "name": "model_2", "input_layers": [["input_2", 0, 0]]}, "backend": "tensorflow"}