{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"input_layers": [["input_2", 0, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 1], "name": "input_2", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_6", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_5", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "leaky_re_lu_5", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_7", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "leaky_re_lu_6", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_4", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_4", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["instance_normalization_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_8", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 256, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_7", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"name": "leaky_re_lu_7", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_5", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_5", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["instance_normalization_5", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_9", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 512, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_8", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"name": "leaky_re_lu_8", "alpha": 0.20000000298023224, "trainable": true}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_6", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "instance_normalization_6", "scale": true, "trainable": true, "beta_regularizer": null, "axis": null, "gamma_constraint": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["instance_normalization_6", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_10", "kernel_size": [4, 4], "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "filters": 1, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "output_layers": [["conv2d_10", 0, 0]]}}