{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_3", "config": {"dtype": "float32", "name": "input_3", "batch_input_shape": [null, 480, 480, 1], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv2d_11", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 32, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_11", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "leaky_re_lu_9", "config": {"trainable": true, "name": "leaky_re_lu_9", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "name": "instance_normalization_7", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_7", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]], "name": "conv2d_12", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_12", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "leaky_re_lu_10", "config": {"trainable": true, "name": "leaky_re_lu_10", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "name": "instance_normalization_8", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_8", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]], "name": "conv2d_13", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_13", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "leaky_re_lu_11", "config": {"trainable": true, "name": "leaky_re_lu_11", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "instance_normalization_9", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_9", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]], "name": "conv2d_14", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 256, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_14", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "leaky_re_lu_12", "config": {"trainable": true, "name": "leaky_re_lu_12", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "name": "instance_normalization_10", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_10", "axis": null}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]], "name": "up_sampling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "name": "conv2d_15", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_15", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "instance_normalization_11", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_11", "axis": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]], "name": "concatenate_1", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "up_sampling2d_2", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "name": "conv2d_16", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_16", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "instance_normalization_12", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_12", "axis": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]], "name": "concatenate_2", "config": {"trainable": true, "axis": -1, "name": "concatenate_2"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "up_sampling2d_3", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_3", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "name": "conv2d_17", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 32, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_17", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "instance_normalization_13", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_13", "axis": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]], "name": "concatenate_3", "config": {"trainable": true, "axis": -1, "name": "concatenate_3"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "up_sampling2d_4", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_4", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "name": "conv2d_18", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 1, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "tanh", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_18", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_3", 0, 0]], "name": "model_3", "output_layers": [["conv2d_18", 0, 0]]}}