{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_4", "config": {"dtype": "float32", "name": "input_4", "batch_input_shape": [null, 480, 480, 1], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_19", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 32, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_19", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "leaky_re_lu_13", "config": {"trainable": true, "name": "leaky_re_lu_13", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "name": "instance_normalization_14", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_14", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]], "name": "conv2d_20", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_20", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "leaky_re_lu_14", "config": {"trainable": true, "name": "leaky_re_lu_14", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "name": "instance_normalization_15", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_15", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]], "name": "conv2d_21", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_21", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "leaky_re_lu_15", "config": {"trainable": true, "name": "leaky_re_lu_15", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "name": "instance_normalization_16", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_16", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]], "name": "conv2d_22", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 256, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_22", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "leaky_re_lu_16", "config": {"trainable": true, "name": "leaky_re_lu_16", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "name": "instance_normalization_17", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_17", "axis": null}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]], "name": "up_sampling2d_5", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_5", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "name": "conv2d_23", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_23", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "instance_normalization_18", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_18", "axis": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]], "name": "concatenate_4", "config": {"trainable": true, "axis": -1, "name": "concatenate_4"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "up_sampling2d_6", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_6", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "name": "conv2d_24", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_24", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "instance_normalization_19", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_19", "axis": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]], "name": "concatenate_5", "config": {"trainable": true, "axis": -1, "name": "concatenate_5"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "name": "up_sampling2d_7", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_7", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]], "name": "conv2d_25", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 32, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_25", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "instance_normalization_20", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_20", "axis": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]], "name": "concatenate_6", "config": {"trainable": true, "axis": -1, "name": "concatenate_6"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "name": "up_sampling2d_8", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_8", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "name": "conv2d_26", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 1, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "tanh", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_26", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_4", 0, 0]], "name": "model_4", "output_layers": [["conv2d_26", 0, 0]]}}