{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 480, 480, 1], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_6", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "leaky_re_lu_5", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.20000000298023224}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv2d_7", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_7", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "leaky_re_lu_6", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "instance_normalization_4", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_4", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_4", 0, 0, {}]]], "name": "conv2d_8", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 256, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_8", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "leaky_re_lu_7", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "instance_normalization_5", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_5", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_5", 0, 0, {}]]], "name": "conv2d_9", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 512, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_9", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "leaky_re_lu_8", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "instance_normalization_6", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_6", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_6", 0, 0, {}]]], "name": "conv2d_10", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 1, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_10", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_2", 0, 0]], "name": "model_2", "output_layers": [["conv2d_10", 0, 0]]}}