{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_6", "config": {"dtype": "float32", "name": "input_6", "batch_input_shape": [null, 480, 480, 1], "sparse": false}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "input_5", "config": {"dtype": "float32", "name": "input_5", "batch_input_shape": [null, 480, 480, 1], "sparse": false}}, {"class_name": "Model", "inbound_nodes": [[["input_6", 0, 0, {}]], [["model_3", 1, 0, {}]]], "name": "model_4", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_4", "config": {"name": "input_4", "dtype": "float32", "batch_input_shape": [null, 480, 480, 1], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_19", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 32, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_19", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "leaky_re_lu_13", "config": {"trainable": true, "name": "leaky_re_lu_13", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "name": "instance_normalization_14", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_14", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]], "name": "conv2d_20", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_20", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "leaky_re_lu_14", "config": {"trainable": true, "name": "leaky_re_lu_14", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "name": "instance_normalization_15", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_15", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]], "name": "conv2d_21", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_21", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "leaky_re_lu_15", "config": {"trainable": true, "name": "leaky_re_lu_15", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "name": "instance_normalization_16", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_16", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]], "name": "conv2d_22", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 256, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_22", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "leaky_re_lu_16", "config": {"trainable": true, "name": "leaky_re_lu_16", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "name": "instance_normalization_17", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_17", "axis": null}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]], "name": "up_sampling2d_5", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_5", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "name": "conv2d_23", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_23", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "instance_normalization_18", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_18", "axis": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]], "name": "concatenate_4", "config": {"trainable": true, "axis": -1, "name": "concatenate_4"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "up_sampling2d_6", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_6", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "name": "conv2d_24", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_24", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "instance_normalization_19", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_19", "axis": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]], "name": "concatenate_5", "config": {"trainable": true, "axis": -1, "name": "concatenate_5"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "name": "up_sampling2d_7", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_7", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]], "name": "conv2d_25", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "filters": 32, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_25", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "instance_normalization_20", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_20", "axis": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]], "name": "concatenate_6", "config": {"trainable": true, "axis": -1, "name": "concatenate_6"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "name": "up_sampling2d_8", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_8", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "name": "conv2d_26", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "filters": 1, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "tanh", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_26", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_4", 0, 0]], "name": "model_4", "output_layers": [["conv2d_26", 0, 0]]}}, {"class_name": "Model", "inbound_nodes": [[["input_5", 0, 0, {}]], [["model_4", 1, 0, {}]]], "name": "model_3", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_3", "config": {"name": "input_3", "dtype": "float32", "batch_input_shape": [null, 480, 480, 1], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv2d_11", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 32, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_11", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "leaky_re_lu_9", "config": {"trainable": true, "name": "leaky_re_lu_9", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "name": "instance_normalization_7", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_7", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]], "name": "conv2d_12", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_12", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "leaky_re_lu_10", "config": {"trainable": true, "name": "leaky_re_lu_10", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "name": "instance_normalization_8", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_8", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]], "name": "conv2d_13", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_13", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "leaky_re_lu_11", "config": {"trainable": true, "name": "leaky_re_lu_11", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "instance_normalization_9", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_9", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]], "name": "conv2d_14", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 256, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_14", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "leaky_re_lu_12", "config": {"trainable": true, "name": "leaky_re_lu_12", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "name": "instance_normalization_10", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_10", "axis": null}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]], "name": "up_sampling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "name": "conv2d_15", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_15", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "instance_normalization_11", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_11", "axis": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]], "name": "concatenate_1", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "up_sampling2d_2", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "name": "conv2d_16", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_16", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "instance_normalization_12", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_12", "axis": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]], "name": "concatenate_2", "config": {"trainable": true, "axis": -1, "name": "concatenate_2"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "up_sampling2d_3", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_3", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "name": "conv2d_17", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "filters": 32, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_17", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "instance_normalization_13", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_13", "axis": null}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]], "name": "concatenate_3", "config": {"trainable": true, "axis": -1, "name": "concatenate_3"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "up_sampling2d_4", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_4", "size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "name": "conv2d_18", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "filters": 1, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "tanh", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_18", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_3", 0, 0]], "name": "model_3", "output_layers": [["conv2d_18", 0, 0]]}}, {"class_name": "Model", "inbound_nodes": [[["model_4", 1, 0, {}]]], "name": "model_1", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 480, 480, 1], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.20000000298023224}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "instance_normalization_1", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_1", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_1", 0, 0, {}]]], "name": "conv2d_3", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 256, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_3", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "leaky_re_lu_3", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "instance_normalization_2", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_2", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_2", 0, 0, {}]]], "name": "conv2d_4", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 512, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_4", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "leaky_re_lu_4", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "instance_normalization_3", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_3", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_3", 0, 0, {}]]], "name": "conv2d_5", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "filters": 1, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_5", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["conv2d_5", 0, 0]]}}, {"class_name": "Model", "inbound_nodes": [[["model_3", 1, 0, {}]]], "name": "model_2", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"name": "input_2", "dtype": "float32", "batch_input_shape": [null, 480, 480, 1], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_6", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "leaky_re_lu_5", "config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.20000000298023224}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv2d_7", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_7", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "leaky_re_lu_6", "config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "instance_normalization_4", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_4", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_4", 0, 0, {}]]], "name": "conv2d_8", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 256, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_8", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "leaky_re_lu_7", "config": {"trainable": true, "name": "leaky_re_lu_7", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "instance_normalization_5", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_5", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_5", 0, 0, {}]]], "name": "conv2d_9", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [2, 2], "filters": 512, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_9", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "leaky_re_lu_8", "config": {"trainable": true, "name": "leaky_re_lu_8", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "instance_normalization_6", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_6", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_6", 0, 0, {}]]], "name": "conv2d_10", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "filters": 1, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_constraint": null, "name": "conv2d_10", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_2", 0, 0]], "name": "model_2", "output_layers": [["conv2d_10", 0, 0]]}}], "input_layers": [["input_5", 0, 0], ["input_6", 0, 0]], "name": "model_5", "output_layers": [["model_1", 1, 0], ["model_2", 1, 0], ["model_3", 1, 0], ["model_4", 1, 0], ["model_4", 2, 0], ["model_3", 2, 0]]}}