{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 480, 480, 1], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.20000000298023224}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 128, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "instance_normalization_1", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_1", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_1", 0, 0, {}]]], "name": "conv2d_3", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 256, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_3", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "leaky_re_lu_3", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "instance_normalization_2", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_2", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_2", 0, 0, {}]]], "name": "conv2d_4", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 512, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_4", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "leaky_re_lu_4", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "instance_normalization_3", "config": {"trainable": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "gamma_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "name": "instance_normalization_3", "axis": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_3", 0, 0, {}]]], "name": "conv2d_5", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 1, "padding": "same", "use_bias": true, "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [4, 4], "kernel_regularizer": null, "name": "conv2d_5", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["conv2d_5", 0, 0]]}}