{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "name": "input_4", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_4", "batch_input_shape": [null, 480, 480, 1]}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 32, "trainable": true, "strides": [2, 2], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_19", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_13", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"name": "leaky_re_lu_13", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_14", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_14", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 64, "trainable": true, "strides": [2, 2], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_20", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_14", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"name": "leaky_re_lu_14", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_15", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_15", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 128, "trainable": true, "strides": [2, 2], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_21", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_15", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"name": "leaky_re_lu_15", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_16", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_16", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 256, "trainable": true, "strides": [2, 2], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_22", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_16", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"name": "leaky_re_lu_16", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_17", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_17", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_5", "inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]], "config": {"name": "up_sampling2d_5", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 128, "trainable": true, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_23", "data_format": "channels_last"}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_18", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_18", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Concatenate", "name": "concatenate_4", "inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_4", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_6", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "config": {"name": "up_sampling2d_6", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 64, "trainable": true, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_24", "data_format": "channels_last"}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_19", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_19", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Concatenate", "name": "concatenate_5", "inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_5", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_7", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "config": {"name": "up_sampling2d_7", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 32, "trainable": true, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_25", "data_format": "channels_last"}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_20", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_20", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Concatenate", "name": "concatenate_6", "inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_6", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_8", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "config": {"name": "up_sampling2d_8", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 1, "trainable": true, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_26", "data_format": "channels_last"}}], "name": "model_4", "output_layers": [["conv2d_26", 0, 0]], "input_layers": [["input_4", 0, 0]]}}