{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "name": "input_6", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_6", "batch_input_shape": [null, 480, 480, 1]}}, {"class_name": "InputLayer", "name": "input_5", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_5", "batch_input_shape": [null, 480, 480, 1]}}, {"class_name": "Model", "name": "model_4", "inbound_nodes": [[["input_6", 0, 0, {}]], [["model_3", 1, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "name": "input_4", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_4", "batch_input_shape": [null, 480, 480, 1]}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 32, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_19", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_13", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"name": "leaky_re_lu_13", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_14", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_14", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 64, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_20", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_14", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"name": "leaky_re_lu_14", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_15", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_15", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 128, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_21", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_15", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"name": "leaky_re_lu_15", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_16", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_16", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 256, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_22", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_16", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"name": "leaky_re_lu_16", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_17", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_17", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_5", "inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]], "config": {"name": "up_sampling2d_5", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "filters": 128, "padding": "same", "strides": [1, 1], "trainable": true, "name": "conv2d_23", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_18", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_18", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Concatenate", "name": "concatenate_4", "inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_4", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_6", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "config": {"name": "up_sampling2d_6", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "name": "conv2d_24", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_19", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_19", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Concatenate", "name": "concatenate_5", "inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_5", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_7", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "config": {"name": "up_sampling2d_7", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "filters": 32, "padding": "same", "strides": [1, 1], "trainable": true, "name": "conv2d_25", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_20", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_20", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Concatenate", "name": "concatenate_6", "inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_6", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_8", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "config": {"name": "up_sampling2d_8", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "tanh", "kernel_regularizer": null, "filters": 1, "padding": "same", "strides": [1, 1], "trainable": true, "name": "conv2d_26", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}], "name": "model_4", "output_layers": [["conv2d_26", 0, 0]], "input_layers": [["input_4", 0, 0]]}}, {"class_name": "Model", "name": "model_3", "inbound_nodes": [[["input_5", 0, 0, {}]], [["model_4", 1, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "name": "input_3", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_3", "batch_input_shape": [null, 480, 480, 1]}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 32, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_11", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_9", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "leaky_re_lu_9", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_7", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 64, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_12", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_10", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"name": "leaky_re_lu_10", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_8", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 128, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_13", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_11", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"name": "leaky_re_lu_11", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_9", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_9", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 256, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_14", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_12", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"name": "leaky_re_lu_12", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_10", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]], "config": {"name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "filters": 128, "padding": "same", "strides": [1, 1], "trainable": true, "name": "conv2d_15", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_11", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_11", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_1", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "filters": 64, "padding": "same", "strides": [1, 1], "trainable": true, "name": "conv2d_16", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_12", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_12", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Concatenate", "name": "concatenate_2", "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_2", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_3", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"name": "up_sampling2d_3", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "filters": 32, "padding": "same", "strides": [1, 1], "trainable": true, "name": "conv2d_17", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_13", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_13", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Concatenate", "name": "concatenate_3", "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_3", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_4", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"name": "up_sampling2d_4", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "tanh", "kernel_regularizer": null, "filters": 1, "padding": "same", "strides": [1, 1], "trainable": true, "name": "conv2d_18", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}], "name": "model_3", "output_layers": [["conv2d_18", 0, 0]], "input_layers": [["input_3", 0, 0]]}}, {"class_name": "Model", "name": "model_1", "inbound_nodes": [[["model_4", 1, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 480, 480, 1]}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 64, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 128, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_1", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["instance_normalization_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 256, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_3", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_2", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["instance_normalization_2", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 512, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_4", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_3", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["instance_normalization_3", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 1, "padding": "same", "strides": [1, 1], "trainable": true, "name": "conv2d_5", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}], "name": "model_1", "output_layers": [["conv2d_5", 0, 0]], "input_layers": [["input_1", 0, 0]]}}, {"class_name": "Model", "name": "model_2", "inbound_nodes": [[["model_3", 1, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_2", "batch_input_shape": [null, 480, 480, 1]}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 64, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_6", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_5", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 128, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_7", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_4", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["instance_normalization_4", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 256, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_8", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_7", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_5", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["instance_normalization_5", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 512, "padding": "same", "strides": [2, 2], "trainable": true, "name": "conv2d_9", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_8", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_6", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["instance_normalization_6", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [4, 4], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "filters": 1, "padding": "same", "strides": [1, 1], "trainable": true, "name": "conv2d_10", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last"}}], "name": "model_2", "output_layers": [["conv2d_10", 0, 0]], "input_layers": [["input_2", 0, 0]]}}], "name": "model_5", "output_layers": [["model_1", 1, 0], ["model_2", 1, 0], ["model_3", 1, 0], ["model_4", 1, 0], ["model_4", 2, 0], ["model_3", 2, 0]], "input_layers": [["input_5", 0, 0], ["input_6", 0, 0]]}}