{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "name": "input_3", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_3", "batch_input_shape": [null, 480, 480, 1]}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 32, "trainable": true, "strides": [2, 2], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_11", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_9", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "leaky_re_lu_9", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_7", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 64, "trainable": true, "strides": [2, 2], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_12", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_10", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"name": "leaky_re_lu_10", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_8", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 128, "trainable": true, "strides": [2, 2], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_13", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_11", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"name": "leaky_re_lu_11", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_9", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_9", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 256, "trainable": true, "strides": [2, 2], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_14", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_12", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"name": "leaky_re_lu_12", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_10", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]], "config": {"name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 128, "trainable": true, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_15", "data_format": "channels_last"}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_11", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_11", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_1", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 64, "trainable": true, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_16", "data_format": "channels_last"}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_12", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_12", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Concatenate", "name": "concatenate_2", "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_2", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_3", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"name": "up_sampling2d_3", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 32, "trainable": true, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_17", "data_format": "channels_last"}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_13", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_13", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Concatenate", "name": "concatenate_3", "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]], "config": {"axis": -1, "name": "concatenate_3", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_4", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"name": "up_sampling2d_4", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 1, "trainable": true, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_18", "data_format": "channels_last"}}], "name": "model_3", "output_layers": [["conv2d_18", 0, 0]], "input_layers": [["input_3", 0, 0]]}}