{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_2", "batch_input_shape": [null, 480, 480, 1]}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 64, "trainable": true, "strides": [2, 2], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_6", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_5", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 128, "trainable": true, "strides": [2, 2], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_7", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_4", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["instance_normalization_4", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 256, "trainable": true, "strides": [2, 2], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_8", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_7", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_5", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["instance_normalization_5", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 512, "trainable": true, "strides": [2, 2], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_9", "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_8", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "InstanceNormalization", "name": "instance_normalization_6", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "instance_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_constraint": null, "axis": null, "center": true}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["instance_normalization_6", 0, 0, {}]]], "config": {"use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [4, 4], "filters": 1, "trainable": true, "strides": [1, 1], "padding": "same", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "conv2d_10", "data_format": "channels_last"}}], "name": "model_2", "output_layers": [["conv2d_10", 0, 0]], "input_layers": [["input_2", 0, 0]]}}