{"config": {"output_layers": [["model_1", 1, 0], ["model_2", 1, 0], ["model_3", 1, 0], ["model_4", 1, 0], ["model_4", 2, 0], ["model_3", 2, 0]], "name": "model_5", "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_6", "batch_input_shape": [null, 128, 128, 1]}, "class_name": "InputLayer", "name": "input_6", "inbound_nodes": []}, {"config": {"sparse": false, "dtype": "float32", "name": "input_5", "batch_input_shape": [null, 128, 128, 1]}, "class_name": "InputLayer", "name": "input_5", "inbound_nodes": []}, {"config": {"output_layers": [["conv2d_26", 0, 0]], "layers": [{"config": {"sparse": false, "name": "input_4", "dtype": "float32", "batch_input_shape": [null, 128, 128, 1]}, "class_name": "InputLayer", "name": "input_4", "inbound_nodes": []}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_19", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_13", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_13", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_14", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_14", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_20", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_14", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_14", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_15", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_15", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 128, "name": "conv2d_21", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_15", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_15", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_16", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_16", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 256, "name": "conv2d_22", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_16", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_16", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_17", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_17", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "up_sampling2d_5", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D", "name": "up_sampling2d_5", "inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 128, "name": "conv2d_23", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_18", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_18", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"config": {"axis": -1, "name": "concatenate_4", "trainable": true}, "class_name": "Concatenate", "name": "concatenate_4", "inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "up_sampling2d_6", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D", "name": "up_sampling2d_6", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_24", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_24", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_19", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_19", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"config": {"axis": -1, "name": "concatenate_5", "trainable": true}, "class_name": "Concatenate", "name": "concatenate_5", "inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "up_sampling2d_7", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D", "name": "up_sampling2d_7", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_25", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_25", "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_20", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_20", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"config": {"axis": -1, "name": "concatenate_6", "trainable": true}, "class_name": "Concatenate", "name": "concatenate_6", "inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "up_sampling2d_8", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D", "name": "up_sampling2d_8", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 1, "name": "conv2d_26", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_26", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]]}], "name": "model_4", "input_layers": [["input_4", 0, 0]]}, "class_name": "Model", "name": "model_4", "inbound_nodes": [[["input_6", 0, 0, {}]], [["model_3", 1, 0, {}]]]}, {"config": {"output_layers": [["conv2d_18", 0, 0]], "layers": [{"config": {"sparse": false, "name": "input_3", "dtype": "float32", "batch_input_shape": [null, 128, 128, 1]}, "class_name": "InputLayer", "name": "input_3", "inbound_nodes": []}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_11", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_9", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_9", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_7", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_7", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_12", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_10", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_10", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_8", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_8", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 128, "name": "conv2d_13", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_11", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_11", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_9", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_9", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 256, "name": "conv2d_14", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_12", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_12", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_10", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_10", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 128, "name": "conv2d_15", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_11", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_11", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_16", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_12", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_12", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"config": {"axis": -1, "name": "concatenate_2", "trainable": true}, "class_name": "Concatenate", "name": "concatenate_2", "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "up_sampling2d_3", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D", "name": "up_sampling2d_3", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 32, "name": "conv2d_17", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_13", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_13", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"config": {"axis": -1, "name": "concatenate_3", "trainable": true}, "class_name": "Concatenate", "name": "concatenate_3", "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "up_sampling2d_4", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D", "name": "up_sampling2d_4", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 1, "name": "conv2d_18", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]]}], "name": "model_3", "input_layers": [["input_3", 0, 0]]}, "class_name": "Model", "name": "model_3", "inbound_nodes": [[["input_5", 0, 0, {}]], [["model_4", 1, 0, {}]]]}, {"config": {"output_layers": [["conv2d_5", 0, 0]], "layers": [{"config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 128, 128, 1]}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_1", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_1", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 128, "name": "conv2d_2", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_2", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_1", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 256, "name": "conv2d_3", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["instance_normalization_1", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_3", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_2", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_2", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 512, "name": "conv2d_4", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["instance_normalization_2", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_4", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_3", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_3", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 1, "name": "conv2d_5", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["instance_normalization_3", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "name": "model_1", "inbound_nodes": [[["model_4", 1, 0, {}]]]}, {"config": {"output_layers": [["conv2d_10", 0, 0]], "layers": [{"config": {"sparse": false, "name": "input_2", "dtype": "float32", "batch_input_shape": [null, 128, 128, 1]}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 64, "name": "conv2d_6", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_5", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_5", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 128, "name": "conv2d_7", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_6", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_4", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_4", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 256, "name": "conv2d_8", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["instance_normalization_4", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_7", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_7", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_5", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_5", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 512, "name": "conv2d_9", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["instance_normalization_5", 0, 0, {}]]]}, {"config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_8", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_8", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"config": {"beta_constraint": null, "axis": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "instance_normalization_6", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "epsilon": 0.001, "gamma_regularizer": null}, "class_name": "InstanceNormalization", "name": "instance_normalization_6", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null, "filters": 1, "name": "conv2d_10", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["instance_normalization_6", 0, 0, {}]]]}], "name": "model_2", "input_layers": [["input_2", 0, 0]]}, "class_name": "Model", "name": "model_2", "inbound_nodes": [[["model_3", 1, 0, {}]]]}], "input_layers": [["input_5", 0, 0], ["input_6", 0, 0]]}, "class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow"}