{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_6", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "sparse": false, "name": "input_6"}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "input_5", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "sparse": false, "name": "input_5"}}, {"class_name": "Model", "inbound_nodes": [[["input_6", 0, 0, {}]], [["model_3", 1, 0, {}]]], "name": "model_4", "config": {"output_layers": [["conv2d_26", 0, 0]], "name": "model_4", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_4", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "sparse": false, "name": "input_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_19", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_19", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "leaky_re_lu_13", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_13"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "name": "instance_normalization_14", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_14", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]], "name": "conv2d_20", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_20", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "leaky_re_lu_14", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_14"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "name": "instance_normalization_15", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_15", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]], "name": "conv2d_21", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_21", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "leaky_re_lu_15", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_15"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "name": "instance_normalization_16", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_16", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]], "name": "conv2d_22", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_22", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "leaky_re_lu_16", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_16"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "name": "instance_normalization_17", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_17", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]], "name": "up_sampling2d_5", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_5"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "name": "conv2d_23", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_23", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "instance_normalization_18", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_18", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]], "name": "concatenate_4", "config": {"trainable": true, "name": "concatenate_4", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "up_sampling2d_6", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_6"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "name": "conv2d_24", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_24", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "instance_normalization_19", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_19", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]], "name": "concatenate_5", "config": {"trainable": true, "name": "concatenate_5", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "name": "up_sampling2d_7", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_7"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]], "name": "conv2d_25", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_25", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "instance_normalization_20", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_20", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]], "name": "concatenate_6", "config": {"trainable": true, "name": "concatenate_6", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "name": "up_sampling2d_8", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_8"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "name": "conv2d_26", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_26", "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_4", 0, 0]]}}, {"class_name": "Model", "inbound_nodes": [[["input_5", 0, 0, {}]], [["model_4", 1, 0, {}]]], "name": "model_3", "config": {"output_layers": [["conv2d_18", 0, 0]], "name": "model_3", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_3", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "sparse": false, "name": "input_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv2d_11", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_11", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "leaky_re_lu_9", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_9"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "name": "instance_normalization_7", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_7", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]], "name": "conv2d_12", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_12", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "leaky_re_lu_10", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_10"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "name": "instance_normalization_8", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_8", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]], "name": "conv2d_13", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_13", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "leaky_re_lu_11", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_11"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "instance_normalization_9", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_9", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]], "name": "conv2d_14", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_14", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "leaky_re_lu_12", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_12"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "name": "instance_normalization_10", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_10", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]], "name": "up_sampling2d_1", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "name": "conv2d_15", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_15", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "instance_normalization_11", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_11", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]], "name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "up_sampling2d_2", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "name": "conv2d_16", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_16", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "instance_normalization_12", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_12", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]], "name": "concatenate_2", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "up_sampling2d_3", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "name": "conv2d_17", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_17", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "instance_normalization_13", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_13", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]], "name": "concatenate_3", "config": {"trainable": true, "name": "concatenate_3", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "up_sampling2d_4", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "name": "conv2d_18", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_18", "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_3", 0, 0]]}}, {"class_name": "Model", "inbound_nodes": [[["model_4", 1, 0, {}]]], "name": "model_1", "config": {"output_layers": [["conv2d_5", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "sparse": false, "name": "input_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_1", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_2", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_2"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "instance_normalization_1", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_1", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_1", 0, 0, {}]]], "name": "conv2d_3", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_3", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "leaky_re_lu_3", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_3"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "instance_normalization_2", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_2", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_2", 0, 0, {}]]], "name": "conv2d_4", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_4", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "leaky_re_lu_4", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_4"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "instance_normalization_3", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_3", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_3", 0, 0, {}]]], "name": "conv2d_5", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_5", "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_1", 0, 0]]}}, {"class_name": "Model", "inbound_nodes": [[["model_3", 1, 0, {}]]], "name": "model_2", "config": {"output_layers": [["conv2d_10", 0, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "sparse": false, "name": "input_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_6", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "leaky_re_lu_5", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_5"}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv2d_7", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_7", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "leaky_re_lu_6", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_6"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "instance_normalization_4", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_4", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_4", 0, 0, {}]]], "name": "conv2d_8", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_8", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "leaky_re_lu_7", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_7"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "instance_normalization_5", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_5", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_5", 0, 0, {}]]], "name": "conv2d_9", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_9", "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "leaky_re_lu_8", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_8"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "instance_normalization_6", "config": {"gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": null, "trainable": true, "name": "instance_normalization_6", "gamma_regularizer": null, "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_6", 0, 0, {}]]], "name": "conv2d_10", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "padding": "same", "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "name": "conv2d_10", "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_2", 0, 0]]}}], "output_layers": [["model_1", 1, 0], ["model_2", 1, 0], ["model_3", 1, 0], ["model_4", 1, 0], ["model_4", 2, 0], ["model_3", 2, 0]], "name": "model_5", "input_layers": [["input_5", 0, 0], ["input_6", 0, 0]]}}