{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "sparse": false, "name": "input_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_1", "filters": 64, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_2", "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_2"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "instance_normalization_1", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_1", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_1", 0, 0, {}]]], "name": "conv2d_3", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_3", "filters": 256, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "leaky_re_lu_3", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_3"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "instance_normalization_2", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_2", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_2", 0, 0, {}]]], "name": "conv2d_4", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_4", "filters": 512, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "leaky_re_lu_4", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_4"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "instance_normalization_3", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_3", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_3", 0, 0, {}]]], "name": "conv2d_5", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_5", "filters": 1, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "output_layers": [["conv2d_5", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}