{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "sparse": false, "name": "input_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_6", "filters": 64, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "leaky_re_lu_5", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_5"}}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "conv2d_7", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_7", "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "leaky_re_lu_6", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_6"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "instance_normalization_4", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_4", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_4", 0, 0, {}]]], "name": "conv2d_8", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_8", "filters": 256, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "leaky_re_lu_7", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_7"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "instance_normalization_5", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_5", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_5", 0, 0, {}]]], "name": "conv2d_9", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_9", "filters": 512, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "leaky_re_lu_8", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_8"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "instance_normalization_6", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_6", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_6", 0, 0, {}]]], "name": "conv2d_10", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_10", "filters": 1, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "output_layers": [["conv2d_10", 0, 0]], "name": "model_2", "input_layers": [["input_2", 0, 0]]}}