{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_3", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "sparse": false, "name": "input_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv2d_11", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_11", "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "leaky_re_lu_9", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_9"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "name": "instance_normalization_7", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_7", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]], "name": "conv2d_12", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_12", "filters": 64, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "leaky_re_lu_10", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_10"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "name": "instance_normalization_8", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_8", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]], "name": "conv2d_13", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_13", "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "leaky_re_lu_11", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_11"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "instance_normalization_9", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_9", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]], "name": "conv2d_14", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_14", "filters": 256, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "leaky_re_lu_12", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_12"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "name": "instance_normalization_10", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_10", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]], "name": "up_sampling2d_1", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "name": "conv2d_15", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_15", "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "instance_normalization_11", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_11", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]], "name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "up_sampling2d_2", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "name": "conv2d_16", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_16", "filters": 64, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "instance_normalization_12", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_12", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]], "name": "concatenate_2", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "up_sampling2d_3", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "name": "conv2d_17", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_17", "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "instance_normalization_13", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_13", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]], "name": "concatenate_3", "config": {"trainable": true, "name": "concatenate_3", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "up_sampling2d_4", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "name": "conv2d_18", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_18", "filters": 1, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "output_layers": [["conv2d_18", 0, 0]], "name": "model_3", "input_layers": [["input_3", 0, 0]]}}