{"class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_4", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "sparse": false, "name": "input_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_19", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_19", "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "leaky_re_lu_13", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_13"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "name": "instance_normalization_14", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_14", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]], "name": "conv2d_20", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_20", "filters": 64, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "leaky_re_lu_14", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_14"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_14", 0, 0, {}]]], "name": "instance_normalization_15", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_15", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]], "name": "conv2d_21", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_21", "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "leaky_re_lu_15", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_15"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "name": "instance_normalization_16", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_16", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Conv2D", "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]], "name": "conv2d_22", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [2, 2], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_22", "filters": 256, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "leaky_re_lu_16", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_16"}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "name": "instance_normalization_17", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_17", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["instance_normalization_17", 0, 0, {}]]], "name": "up_sampling2d_5", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_5"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "name": "conv2d_23", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_23", "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "instance_normalization_18", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_18", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_18", 0, 0, {}], ["instance_normalization_16", 0, 0, {}]]], "name": "concatenate_4", "config": {"trainable": true, "name": "concatenate_4", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "up_sampling2d_6", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_6"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "name": "conv2d_24", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_24", "filters": 64, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "instance_normalization_19", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_19", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_19", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]], "name": "concatenate_5", "config": {"trainable": true, "name": "concatenate_5", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "name": "up_sampling2d_7", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_7"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]], "name": "conv2d_25", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_25", "filters": 32, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "InstanceNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "instance_normalization_20", "config": {"gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": null, "name": "instance_normalization_20", "trainable": true, "center": true, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "Concatenate", "inbound_nodes": [[["instance_normalization_20", 0, 0, {}], ["instance_normalization_14", 0, 0, {}]]], "name": "concatenate_6", "config": {"trainable": true, "name": "concatenate_6", "axis": -1}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "name": "up_sampling2d_8", "config": {"size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "up_sampling2d_8"}}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]], "name": "conv2d_26", "config": {"dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_size": [4, 4], "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "conv2d_26", "filters": 1, "bias_regularizer": null, "kernel_constraint": null, "padding": "same", "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "output_layers": [["conv2d_26", 0, 0]], "name": "model_4", "input_layers": [["input_4", 0, 0]]}}